# %s : 글자데이터 들어올 자리
# %d : 정수데이터(숫자)들어올 자리
# %f : 실수(소숫점)데이터 들어올 자리
# -----------------------------------------------------------

# 이름 => 보드마카
# 가격 => 500

# -----------------------------------------------------------
name = "보드마카"
print(name)
print(type(name))
print(id(name))
print("-----------------")
price = 500
print(price)
print(type(price))
print(id(price))

# -----------------------------------------------------------
print(name, type(name), id(name))
print(price, type(name), id(price))
# type(name, price) / id(name, price) 이런식으로는 못함
# ==> type() / id() 이거 자체가 하나임

# -----------------------------------------------------------
print("품명 : ", name, ", 가격 : ", price, "원")

# -----------------------------------------------------------
# 형식 지정 출력
# %s : 글자데이터 들어올 자리
print("품명 : %s" % name)
print("색상 : %s" % name)

# -----------------------------------------------------------
# %d : 정수데이터(숫자)들어올 자리
print("가격 : %d원" % price)
# %0숫자d : 무조건 숫자만큼의 자릿수로
print("가격 : %06d원" % price)  # 000500 이렇게 출력됨
print("품명 : %s, 가격 : %d원" % (name, price))

# -----------------------------------------------------------
# %f : 실수(소숫점)데이터 들어올 자리
length = 3.141957
print("길이 : %fcm" % length)
# %.숫자f : 소숫점 자리수(반올림해서)
print("길이 : %.2fcm" % length)  # 소숫점 4자리까지(반올림됨)

# -----------------------------------------------------------
# %b : 논리형 데이터 들어올 자리 (true, false)
#    ==> 다른 언어에서는 있는데, Python에서 삭제된 명령어
# Python 에서 안씀
# isBlack = True
# print("검정색이니? %b" % isBlack)

# -----------------------------------------------------------
# 연습문제 1#
humidity = 40.345  # 습도는 40.3%입니다 ==>출력해봐
print("습도는 %.1f%%입니다." % humidity) # %출력하고싶으면 %% 두개써

