# 반복문
#   푸쉬업 10번 반복 - 반복횟수   -> Python에 이거 없음
#   푸쉬업 점심시간까지 - 반복조건
#   ??? - 컬렉션 차례대로 탐색

# 컬렉션 차례대로 탐색 식
# for 변수명 in 컬렉션명:
#   내용
from time import sleep


a = [12, 34, 55, 678, 52, 1024, 5562]
for v in a:
    print(v)
print("---------------------------------")


# b = [1, 2, 3, 4, 5, 6]
# b = range(1,7) / b = [1, 2, 3, 4, 5, 6] 이거랑 같음
# for w in b:
for w in range(1, 7):  # 최종 모양 이렇게 b가 range(1,7) 이니까 b자리에 넣으면됨
    print(w)
print("---------------------------------")

# 0 1 2 3 4 반복문써서 출력시켜

# a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
a = range(11)
for repeat in range(11):
    print(repeat)
print("-----------------------------------------")

# 2, 4, 6, 8, 10 반복문써서 출력
for repeat in range(2, 11, 2):
    print(repeat)
print("-----------------------------------------")

# 1 부터 10까지 곱해보자
gob = 1
for i in range(1, 11):
    gob *= i
print(gob)
print("-----------------------------------------")

l = ["ㅋ", "ㅎ", "ㅍ", "ㅌ"]
# len(l) : 내용물 갯수 세는것
# range(len(l)) : 0 ~ 3 내용물 순서 (0부터 시작함)
# l[0] : ㅋ
for i in range(len(l)):
    print(l[i])
print("------------------------------------------")
for v in l:
    print(v) # 위 45,46이랑 같음 -> 단순히 값만
print("------------------------------------------")
for (i, v) in enumerate(l): # 인덱스(순서번호), 값 둘다 나오게 하고싶으면
    print(i) #순서번호 필요하면
    print(v) #값 필요하면
print("------------------------------------------")
# dict탐색
d = {"색": "검정", "가격": 500}
for (k, v) in d.items(): #키랑 값을 줌
    print(k) #키값
    print(v) #값
