# 1) 유지보수의 시대
# 2) 협업
#       파일 하나를 여러명이 나눠서 작업
#       파일 하나는 한명이 책임지고 끝낼수 있게 -이게 편함
# -> 파일 하나를 한명이 책임지고 끝낼 수 있게, 나눠서 작업하자
####################################################################
# Python 
#       - 효율적인 프로그램 보다는 사람이 개발하기 편한 프로그램
#       - 규칙 보다는 자유 ->그래서 가독성에 신경써야함
#       - 개발자들이 많다-> 본인들이 작업한거 공유하는 문화가 있음
#           -> 남이 만든거 잘 갖다 써보자
#           -> 남꺼 갖다 쓰면 이름 중복 빈번 -> 어캐 해결? package로 해결
#               -> package명까지 똑같으면? -> 방법없음 기도메타
#               -> package명은 전세계적으로 중복 안되게 신경써서 지어야함
#               -> 알아서 잘해봐라 

####################################################################
#  vscode : Python 전용 툴 아님 -> Python의 용어가 아님
#  vscode에서 package만드려면 폴더로 만들어
#   -> 그 폴더안에 __init__.py 파일 만들기


# Python에서 file 소스 
#   => module(.py) 그 안에 class 쓰고~~

# Python : Hybrid한 객체지향언어
#   package(필수는 아님) => module(.py) -> class(객체지향하기 싫으면 없어도 되는거)
# 
# import
#       선택사항 : 안해도 되는데, 하면 문법이 간단해짐
#       필수사항 : 외부파일에 있는거 가져오려면 필수 (파이썬은 필수 ㅇㅇ)
#                   -> 그 소스가 들어오는 셈  -> 이건 뭔솔?


